# Pandas Introduction

###### pandas is a python module that makes data science effective.

###### Weather Dataset

In [13]:
import pandas as pd

df = pd.read_csv('weather.csv')

df.head()#gives 1st 5 rows
df.tail()#gives last 5 rows

#head and tail take number of rows as values to

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [11]:
#max temprature in the month of january 
df['Temperature'].max()

50

In [12]:
#dates in which the event rain occoured 
df['EST'][df['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [9]:
#calculate mean wind speed 
df['WindSpeedMPH'].mean()

6.892857142857143

In [14]:
#slicing
df[2:5]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [15]:
#print columns in a df
df.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [17]:
df.EST

0      1/1/2016
1      1/2/2016
2      1/3/2016
3      1/4/2016
4      1/5/2016
5      1/6/2016
6      1/7/2016
7      1/8/2016
8      1/9/2016
9     1/10/2016
10    1/11/2016
11    1/12/2016
12    1/13/2016
13    1/14/2016
14    1/15/2016
15    1/16/2016
16    1/17/2016
17    1/18/2016
18    1/19/2016
19    1/20/2016
20    1/21/2016
21    1/22/2016
22    1/23/2016
23    1/24/2016
24    1/25/2016
25    1/26/2016
26    1/27/2016
27    1/28/2016
28    1/29/2016
29    1/30/2016
30    1/31/2016
Name: EST, dtype: object

In [18]:
df.shape

(31, 11)

In [19]:
df[['EST','Events']]

          EST    Events
0    1/1/2016       NaN
1    1/2/2016       NaN
2    1/3/2016       NaN
3    1/4/2016       NaN
4    1/5/2016       NaN
5    1/6/2016       NaN
6    1/7/2016       NaN
7    1/8/2016       NaN
8    1/9/2016      Rain
9   1/10/2016      Rain
10  1/11/2016       NaN
11  1/12/2016       NaN
12  1/13/2016       NaN
13  1/14/2016       NaN
14  1/15/2016       NaN
15  1/16/2016      Rain
16  1/17/2016  Fog-Snow
17  1/18/2016      Snow
18  1/19/2016       NaN
19  1/20/2016       NaN
20  1/21/2016       NaN
21  1/22/2016      Snow
22  1/23/2016  Fog-Snow
23  1/24/2016      Snow
24  1/25/2016       NaN
25  1/26/2016       NaN
26  1/27/2016      Rain
27  1/28/2016       NaN
28  1/29/2016       NaN
29  1/30/2016       NaN
30  1/31/2016       NaN

In [23]:
#to get max of a column
df['Temperature'].max()

50

In [24]:
#to get min of a column
df['Temperature'].min()

20

In [25]:
#gives statistical details of a column
df['Temperature'].describe()

count    31.000000
mean     34.677419
std       7.639315
min      20.000000
25%      29.000000
50%      35.000000
75%      39.500000
max      50.000000
Name: Temperature, dtype: float64

In [26]:
#details of all the rows
df.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [32]:
#to get the ro
df[df.Temperature == df.Temperature.max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

# Read and write CSV and XLS files

In [38]:
#install xlrd this helps to read excel data 
df = pd.read_excel('Spam.xls')

In [40]:
#how to write data to csv 
df.to_csv('new.csv')#this defaultly adds index to the data to avoid index
df.to_csv('new_noindex.csv',index=False)

In [41]:
#to store data into excel file we have install openpyxl
#pip install openpyxl

#writing DF to Excel 
df.to_excel('new.xlsx',sheet_name='Spam')

# Group By

In [46]:
import pandas as pd 
df = pd.read_csv('weather_data_cities.csv')

In [48]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [50]:
g = df.groupby('city')

In [51]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [52]:
g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [54]:
#find max values of all the cities
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [55]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [56]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatinating DataFrames

In [59]:
import pandas as pd
#using dictionary or a hash map
indian_weather = pd.DataFrame({
        
        "city"  :  ["mumbai","delhi","banglore"],
 "temperature"  :  [32,45,30],
    "humidity"  :  [80,60,78]
    
})

indian_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [60]:
us_weather = pd.DataFrame({
        
        "city"  :  ["new york","indiana","orlando"],
 "temperature"  :  [21,14,35],
    "humidity"  :  [68,65,75]
    
})

us_weather

       city  temperature  humidity
0  new york           21        68
1   indiana           14        65
2   orlando           35        75

In [61]:
#concatinating two dataframes 
#concatinatig dataframe to coloumn

df = pd.concat([india_weather,us_weather])

df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   indiana           14        65
2   orlando           35        75

#### ******* To avoidy pandas repeated inexing problem we can use ignore_index flag 
#### provided by pandas.concat function

In [62]:
df = pd.concat([india_weather,us_weather],ignore_index=True)

df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   indiana           14        65
5   orlando           35        75

###### To concat rows we can speciy axis=1

In [66]:
df = pd.concat([india_weather,us_weather],axis=1)

df

       city  temperature  humidity      city  temperature  humidity
0    mumbai           32        80  new york           21        68
1     delhi           45        60   indiana           14        65
2  banglore           30        78   orlando           35        75

# Merge DataFrames

merging is simillar to join command in SQL

In [69]:
temprature_df = pd.DataFrame({
        
        "city"  :  ["mumbai","delhi","banglore","hydrabad"],
 "temperature"  :  [32,45,30,40],    
})

temprature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30
3  hydrabad           40

In [71]:
humidity_df = pd.DataFrame({
        
        "city"  :  ["mumbai","delhi","banglore"],
    "humidity"  :  [68,65,75],    
})

humidity_df

       city  humidity
0    mumbai        68
1     delhi        65
2  banglore        75

In [75]:
df = pd.merge(temprature_df,humidity_df,on='city')

#the above statement means merge the above two datasets on the basis of city 

df

       city  temperature  humidity
0    mumbai           32        68
1     delhi           45        65
2  banglore           30        75

#### the above operation removed hyderabad for our dataframe that is a bad practice as we loose data as the above operation performs inner join

#### To solve this problem we can use outer join

In [77]:
df = pd.merge(temprature_df,humidity_df,on='city',how='outer')

df

       city  temperature  humidity
0    mumbai           32      68.0
1     delhi           45      65.0
2  banglore           30      75.0
3  hydrabad           40       NaN

# Numerical Indexing(.loc vs iloc)

#### we can always create our own indexing using index value of dataframe

In [78]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,10],index=[49,48,45,1,2,3,4,5,6,7])



df

     0
49   1
48   2
45   3
1    4
2    5
3    6
4    7
5    8
6    9
7   10

there are two ways of accessing data using indexing 

1 . if we give our own indexing ie.
    data at index 46

2 . or data at row number 3

there are two commands that facilitate these operations 

1 .loc

2 .iloc

In [81]:
df.loc[45]

0    3
Name: 45, dtype: int64

In [85]:
df.iloc[2]

0    3
Name: 45, dtype: int64

In [87]:
df.loc[:2] #loc[start_index:endindex(exclusive)]

    0
49  1
48  2
45  3
1   4
2   5

In [89]:
df.iloc[:2] #iloc[start_index:endindex(exclusive)]

    0
49  1
48  2